---
type: StructuralSection
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 24
tags: [revit-api, class]
---

# StructuralSection

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection` · Revit 2024 · 24 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundarySize | 2015 | `public UV GetBoundarySize ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Property | AnalysisParams | 2015 | `public StructuralSectionAnalysisParams AnalysisParams { get ; }` |
| Property | ElasticModulusStrongAxis | 2015 | `public double ElasticModulusStrongAxis { get ; set ; }` |
| Property | ElasticModulusWeakAxis | 2015 | `public double ElasticModulusWeakAxis { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MomentOfInertiaStrongAxis | 2015 | `public double MomentOfInertiaStrongAxis { get ; set ; }` |
| Property | MomentOfInertiaWeakAxis | 2015 | `public double MomentOfInertiaWeakAxis { get ; set ; }` |
| Property | NominalWeight | 2015 | `public double NominalWeight { get ; set ; }` |
| Property | Perimeter | 2015 | `public double Perimeter { get ; set ; }` |
| Property | PlasticModulusStrongAxis | 2015 | `public double PlasticModulusStrongAxis { get ; set ; }` |
| Property | PlasticModulusWeakAxis | 2015 | `public double PlasticModulusWeakAxis { get ; set ; }` |
| Property | PrincipalAxesAngle | 2015 | `public double PrincipalAxesAngle { get ; set ; }` |
| Property | SectionArea | 2015 | `public double SectionArea { get ; set ; }` |
| Property | SectionNameKey | 2015 | `public string SectionNameKey { get ; set ; }` |
| Property | ShearAreaStrongAxis | 2015 | `public double ShearAreaStrongAxis { get ; set ; }` |
| Property | ShearAreaWeakAxis | 2015 | `public double ShearAreaWeakAxis { get ; set ; }` |
| Property | StructuralSectionGeneralShape | 2015 | `public StructuralSectionGeneralShape StructuralSectionGeneralShape { get ; }` |
| Property | StructuralSectionShape | 2015 | `public StructuralSectionShape StructuralSectionShape { get ; }` |
| Property | StructuralSectionShapeName | 2015 | `public string StructuralSectionShapeName { get ; }` |
| Property | TorsionalModulus | 2015 | `public double TorsionalModulus { get ; set ; }` |
| Property | TorsionalMomentOfInertia | 2015 | `public double TorsionalMomentOfInertia { get ; set ; }` |
| Property | WarpingConstant | 2015 | `public double WarpingConstant { get ; set ; }` |